[
  {
    "id": "1",
    "title": "모던 자바스크립트 Deep Dive",
    "subTitle": "자바스크립트의 기본 개념과 동작 원리",
    "description": "269개의 그림과 원리를 파헤치는 설명으로 ‘자바스크립트의 기본 개념과 동작 원리’를 이해하자!\n\n웹페이지의 단순한 보조 기능을 처리하기 위한 제한적인 용도로 태어난 자바스크립트는 과도하다고 느껴질 만큼 친절한 프로그래밍 언어입니다. 이러한 자바스크립트의 특징은 편리한 경우도 있지만 내부 동작을 이해하기 어렵게 만들기도 합니다.\n\n하지만 자바스크립트는 더 이상 제한적인 용도의 프로그래밍 언어가 아닙니다. 오랜 변화를 거쳐 이제 자바스크립트는 프런트엔드와 백엔드 영역의 프로그래밍 언어로 사용할 수 있는 명실상부한 범용 애플리케이션 개발 언어로 성장했습니다. 따라서 자바스크립트를 학습하는 방식도 이에 걸맞게 변화해야 하며, 이 책은 자바스크립트의 기본 개념과 동작 원리를 깊이 있게 학습하고자 하는 독자를 위해 기획되었습니다.\n\n《모던 자바스크립트 Deep Dive》에서는 자바스크립트를 둘러싼 기본 개념을 정확하고 구체적으로 설명하고, 자바스크립트 코드의 동작 원리를 집요하게 파헤칩니다. 따라서 여러분이 작성한 코드가 컴퓨터 내부에서 어떻게 동작할 것인지 예측하고, 명확히 설명할 수 있도록 돕습니다. 또한 최신 자바스크립트 명세를 반영해 안정적이고 효율적인 코드를 작성할 수 있는 기본기를 다지고, 실전에서 쓰이는 모던 자바스크립트 프레임워크나 도구를 완벽하게 이해하고 활용할 수 있게 도와줍니다.",
    "author": "이웅모",
    "publisher": "위키북스",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3247271/32472713016.20250414072056.jpg"
  },
  {
    "id": "2",
    "title": "한 입 크기로 잘라 먹는 리액트",
    "subTitle": "자바스크립트 기초부터 애플리케이션 배포까지",
    "description": "자바스크립트 기초부터 애플리케이션 배포까지\n처음 시작하기 딱 좋은 리액트 입문서\n\n이 책은 웹 개발에서 가장 많이 사용하는 프레임워크인 리액트 사용 방법을 소개합니다. 인프런, 유데미에서 5000여 명이 수강한 베스트 강좌를 책으로 엮었습니다. 프런트엔드 개발을 희망하는 사람들을 위해 리액트의 기본을 익히고 다양한 앱을 구현하는 데 부족함이 없도록 만들었습니다. \n\n자바스크립트 기초 지식이 부족해 리액트 공부를 망설이는 분, 프런트엔드 개발을 희망하는 취준생으로 리액트가 처음인 분, 퍼블리셔나 백엔드에서 프런트엔드로 직군 전환을 꾀하거나 업무상 리액트가 필요한 분, 뷰, 스벨트 등 다른 프레임워크를 쓰고 있는데, 실용적인 리액트를 배우고 싶은 분, 신입 개발자이지만 자바스크립트나 리액트 기초가 부족한 분에게 유용할 것입니다.",
    "author": "이정환",
    "publisher": "프로그래밍인사이트",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3888828/38888282618.20230913071643.jpg"
  },
  {
    "id": "3",
    "title": "러닝스쿨! 자바스크립트 첫걸음",
    "subTitle": "처음 프로그래밍을 시작하는 입문자의 눈높이에 맞춘",
    "description": "실무에 꼭 필요한 자바스크립트 필수 지식과 핵심 기술을 가장 쉽게 설명한 입문서!\n\n《러닝스쿨! 자바스크립트 첫걸음》은 자바스크립트의 기초부터 프런트엔드 개발의 최신 트렌드까지 웹 개발을 시작하려는 분들에게 필수적인 지식을 제공하는 책입니다. 현재 가장 인기 있는 기술인 React.js와 Next.js를 배우고 싶은 초보자부터, 이미 이 기술들을 다루고 있는 개발자 모두에게 적합합니다. \n\n실무에서 자주 사용되는 문법들을 위주로, 이해하기 쉬운 예제와 명확한 설명으로 기초적인 개념부터 심화 내용까지 단계별로 배울 수 있고, 이를 활용해 프로젝트를 개발하는 과정까지 다양한 예제와 친절한 설명으로 쉽게 이해할 수 있도록 도와주는 책입니다. 《러닝스쿨! 자바스크립트 첫걸음》을 통해 웹 개발에 첫걸음을 내딛어 보길 바랍니다.",
    "author": "김효빈",
    "publisher": "위키북스",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_4731061/47310617618.20240426090954.jpg"
  },
  {
    "id": "4",
    "title": "이펙티브 타입스크립트",
    "subTitle": "동작 원리의 이해와 구체적인 조언 62가지",
    "description": "타입스크립트는 타입 정보를 지닌 자바스크립트의 상위 집합으로, 자바스크립트의 골치 아픈 문제점들을 해결해 준다. 이 책은 《이펙티브 C++》와 《이펙티브 자바》의 형식을 차용해 타입스크립트의 동작 원리, 해야 할 것과 하지 말아야 할 것에 대한 구체적인 조언을 62가지 항목으로 나누어 담았다.\n각 항목의 조언을 실제로 적용한 예제를 통해 연습하다 보면 타입스크립트를 효율적으로 사용하는 방법을 익힐 수 있다. 타입스크립트를 기초적인 수준에서만 활용했다면 이 책을 통해 타입스크립트 전문가로 거듭나 보자.\n\n이 책에서 다루는 내용\nㆍ 타입스크립트의 타입 시스템에 대한 자세한 이해\nㆍ 안전하고 명료한 코드를 작성할 수 있는 타입 설계\nㆍ 최소한의 타입 구문으로 완전한 안전성을 얻을 수 있는 타입 추론\nㆍ any 타입의 전략적 사용\nㆍ 의존성과 타입 선언 파일이 동작하는 원리\nㆍ 자바스크립트를 타입스크립트로 마이그레이션하는 방법",
    "author": "댄 밴더캄",
    "publisher": "인사이트",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3247334/32473346832.20221227204218.jpg"
  },
  {
    "id": "5",
    "title": "Clean Code(클린 코드)",
    "subTitle": "애자일 소프트웨어 장인 정신",
    "description": "프로그래머, 소프트웨어 공학도, 프로젝트 관리자, 팀 리더, 시스템 분석가에게 도움이 될\n더 나은 코드를 만드는 책\n\n『Clean Code(클린 코드)』은 오브젝트 멘토(Object Mentor)의 동료들과 힘을 모아 ‘개발하며’ 클린 코드를 만드는 최상의 애자일 기법을 소개하고 있다. 소프트웨어 장인 정신의 가치를 심어 주며 프로그래밍 실력을 높여줄 것이다. 여러분이 노력만 한다면. 어떤 노력이 필요하냐고? 코드를 읽어야 한다. 아주 많은 코드를. 그리고 코드를 읽으면서 그 코드의 무엇이 옳은지, 그른지 생각도 해야 한다. 좀 더 중요하게는 전문가로서 자신이 지니는 가치와 장인으로서 자기 작품에 대한 헌신을 돌아보게 된다.",
    "author": "로버트 C. 마틴",
    "publisher": "인사이트",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3247419/32474195676.20230718122457.jpg"
  },
  {
    "id": "6",
    "title": "Node.js 교과서",
    "subTitle": "본기에 충실한 Node.js 18 입문서",
    "description": "Node.js 베스트셀러 1위! 개정 3판!\n한 권으로 끝내는, 노드 기본부터 실무까지 전 과정 총망라!\n다양한 서비스를 직접 만드는, 실무에 가장 가까운 강의!\n\n개정 3판을 맞아 노드와 npm 패키지 버전을 최신으로 업데이트하고, 컨트롤러와 서비스를 분리해 사용하는 방식으로 예제 구조를 변경하면서 9~13장까지 모든 코드를 수정하며 완성도를 높였다. ES2022에 맞춰 Map/Set과 널 병합, 옵셔널 체이닝을 예제 코드 전반에 사용하고 관련 문법을 설명했으며, 정식 지원되는 ECMAScript 모듈 사용법도 추가했다. 또한, 요즘 적극적으로 도입되는 추세에 맞춰 노드 프로젝트를 타입스크립트로 전환하는 방법도 추가했다.\n이 책은 프런트부터 서버, 데이터베이스, 배포까지 아우르는 광범위한 내용을 다룬다. 군더더기 없는 직관적인 설명으로 기본 개념을 확실히 이해하고, 노드의 기능과 생태계를 사용해보면서 실제로 동작하는 서버를 만들어보자. 웹 서버, 웹 API 서버, 노드 서비스 테스트, SNS 서비스, 실시간 GIF 채팅방, 경매 시스템, 커맨드라인 인터페이스까지 경험할 수 있으며, 예제와 코드는 최신 문법을 사용해 실무에 바로 참고하거나 적용할 수 있게 했다.",
    "author": "조현영",
    "publisher": "길벗",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3647026/36470265624.20230110165934.jpg"
  },
  {
    "id": "7",
    "title": "Vue.js 철저 입문",
    "subTitle": "기초부터 실전 애플리케이션 개발까지",
    "description": "Vue.js 입문서 결정판. 초보부터 실무까지 이 책 한권으로!\n\nVue.js는 깃허브에서 ‘가장 인기 있는 자바스크립트 프레임워크’로 꼽힐 만큼 많은 주목을 받고 있는 기술입니다. 《Vue.js 철저 입문》에서는 프런트 엔드 특화 라이브러리 중에서 가장 큰 지지를 받는 Vue.js를 중심으로 현대적인 프런트 엔드 개발을 경험해 볼 수 있게 구성했습니다.\n\n사용하기 쉽고 현업에서 많이 사용되는 Vue.js를 Vue.js 코어 팀 멤버가 기초부터 알기 쉽게 직접 설명했으며 실무에서 활용할 수 있는 설계 능력 및 업무 능력을 익힐 수 있게 도와줍니다. 소규모 프로젝트에 적용하는 예부터 jQuery에서 이주하는 방법, 대규모 개발을 염두에 둔 애플리케이션 개발 방법까지 이 책 한권으로 기초부터 실무까지 철저하게 배울 수 있습니다.",
    "author": "카와구치 카즈야,키타 케이스케,노다 요헤이,테지마 타쿠야,카타야마 신야",
    "publisher": "위키북스",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3243624/32436246882.20221230073852.jpg"
  },
  {
    "id": "8",
    "title": "실전 리액트 프로그래밍",
    "subTitle": "리액트 훅부터 Next.js까지",
    "description": "핵심 원리로 리액트의 기본 개념을 다지고,\n리액트 훅으로 구현된 실전 예제를 통해 활용법을 익힌다!\n\n리액트 훅으로 작성된 예제와 핵심 원리를 통해 리액트의 실전 사용법을 익힐 수 있다. 단순히 기술을 소개하는 데 그치지 않고 그 기술을 사용하는 이유를 함께 다룬다. 따라서 리액트뿐 아니라 앞으로 만나게 될 어떤 기술도 빠르게 배울 수 있는 기본기를 쌓을 수 있다. 리액트를 이미 사용해 본 사람을 대상으로 쓰였지만 기초부터 시작한다. 우선 리액트 프로젝트를 구축하고, 최신 자바스크립트 문법, 리액트의 주요 개념을 간단히 알아본다. 클래스형 컴포넌트를 설명하는 부분을 제외하고 이 책의 모든 예제는 리액트 훅으로 작성했다.\n리액트 훅의 개념과 실제 활용할 때 도움이 되는 고급 활용법을 알아본 후 리덕스, 바벨, 웹팩까지 다룬다. 서버사이드 렌더링의 개념과 Next.js 프로젝트를 구축하는 방법을 살펴본 후 타입스크립트를 이용해 리액트 코드를 작성한다. 추후 리액트에 추가될 것으로 예상되는 concurrent 모드까지 다뤄서 다가올 변화에도 대비한다.",
    "author": "이재승",
    "publisher": "인사이트",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3245505/32455053560.20221019132703.jpg"
  },
  {
    "id": "9",
    "title": "자바스크립트 완벽 가이드",
    "subTitle": "JavaScript: The Defintive Guide 7/E",
    "description": "25년 넘게 사랑받은 자바스크립트 프로그래밍 베스트셀러!\nES2020 개정 반영, 자바스크립트 기초부터 최신 기능까지\n\n자바스크립트는 웹의 프로그래밍 언어로, 요즘 소프트웨어 개발자 사이에서 다른 어떤 언어보다도 많이 사용된다. 《자바스크립트 완벽 가이드》는 25년 가까이 자바스크립트 프로그래머에게 가장 사랑받은 베스트셀러이며 이번 7판은 자바스크립트 2020 버전에 맞게 완전히 개정됐다. 책 전반에 걸쳐 흥미롭고 유용한 예제를 만날 수 있으며 클래스, 모듈, 이터레이터, 제너레이터, 프라미스, async/await를 다루는 장이 새롭게 추가됐다.\n자바스크립트를 처음 배우는 프로그래머, 자바스크립트에 대해 어느 정도 알고 있지만 그 지식을 더 완벽하게 가다듬고자 하는 웹 개발자에게 도움이 될 것이다.\n“이 책에는 당신이 자바스크립트에 대해 알지 못했던 모든 것이 담겨 있습니다. 자바스크립트 코드의 품질과 생산성을 한 단계 끌어 올리십시오. 자바스크립트라는 복잡하고 변덕스러운 언어에 대한 데이비드의 지식은 놀라운 수준이며, 그 지식이 《자바스크립트 완벽 가이드》에서 빛을 발합니다.”\n- 샤르크 니들링(Schalk Neethling), MDN 웹 문서 선임 프론트엔드 엔지니어\n“데이비드 플래너건은 여러분을 자바스크립트 언어와 그 생태계로 편안하게 안내합니다.”\n- 사라 와크스(Sarah Wachs), 프론트엔드 개발자이자 우먼 후 코드 베를린에서 근무",
    "author": "데이비드 플래너건",
    "publisher": "인사이트",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3243624/32436248685.20231004072451.jpg"
  },
  {
    "id": "10",
    "title": "알고리즘 도감",
    "subTitle": "그림으로 배우는 알고리즘 26",
    "description": "앱과 함께 직관적으로 배우는 알고리즘 학습서!\n\n이 책은 알고리즘을 배우는 데 최고로 평가받고 있는 ‘Algorithms’ 앱을 토대로 특별히 고안된 책입니다. 처음 배울 때는 이해하기 쉽고, 다시 배울 때도 쉽게 내용을 떠올릴 수 있도록 구성했습니다. 26개의 핵심 알고리즘과 7개의 데이터 구조 모두를 그림으로 표현하여 개념이나 구조를 직관적으로 이해할 수 있습니다.",
    "author": "이시다 모리테루,미야자키 쇼이치",
    "publisher": "제이펍",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3243908/32439081775.20230802071218.jpg?"
  },
  {
    "id": "11",
    "title": "프로그래밍 패턴",
    "subTitle": "프로그램을 작성하는 33가지 방법",
    "description": "『프로그래밍 패턴』은 1940년대 프랑스 작가 레몽 크노가 쓴 '문체 연습'이라는 책의 형식을 빌려 다양한 방법으로 프로그램을 작성하는 방법을 알려주는 책이다. 이 책에서는 단어 빈도 세기라는 간단한 주제로 무려 33가지 서로 다른 형식의 프로그램을 만들어 낸다. 누구나 흔히 생각해 낼 수 있는 전통적 방법부터 최신 기법에 이르기까지 다양한 방식으로 변주하며 그 예를 보여 준다. 더구나 예에 그치지 않고 실제 시스템을 설계할 때 어떤 식으로 활용할 수 있을지를 고민할 뿐만 아니라, 해당 형식이 어떻게 탄생하게 됐는지 그 배경을 살짝 엿보는 즐거움을 덤으로 얻을 수 있다",
    "author": "크리스티나 로페즈",
    "publisher": "위키북스",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3249412/32494122035.20220527050333.jpg"
  },
  {
    "id": "12",
    "title": "웹 성능 최적화 기법",
    "subTitle": "웹에 날개를 달아주는",
    "description": "이론부터 실습까지, 현장에 적용할 수 있는 웹 성능 최적화의 모든 것\n\n이 책은 국내에서 오랫동안 웹 성능을 연구하고 최적화를 적용해 온 전문가 3인의 경험을 체계적으로 집약한 책입니다. 웹 성능, 웹 성능에 영향을 주는 요소, 웹 성능을 평가하는 방법과 최적화 트렌드 그리고 기술에 이르기까지 프런트엔드 최적화에 관한 전반적인 내용을 다루고 있습니다.\n\n또한 단순히 개념과 이론을 설명하는 것에 그치지 않고 다양한 예제와 실습을 통해 직접 웹 사이트 성능을 평가하고 최적화를 진행해 볼 수 있도록 구성되었습니다. 따라서 이 책을 통해 웹 사이트 개발부터 운영까지 전 과정에 다양한 최적화 방법들을 적용하면 더욱 빠르고 기능적인 사이트를 만들고 운영할 수 있습니다.",
    "author": "강상진,윤호성,박정현",
    "publisher": "루비페이퍼",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3247423/32474235225.20221228074323.jpg"
  },
  {
    "id": "13",
    "title": "앵귤러 첫걸음",
    "subTitle": "개발 환경 설정부터 컴포넌트 테스트까지 다양한 예제로 익히는, 앵귤러 4.타입스크립트 2.ECMAScript 6 기반",
    "description": "기초 다지기, 기본기 향상하기, 깊이 들어가기로 나누어 앵귤러를 설명하고 실제 프로젝트인 상품 관리 애플리케이션을 결과물로 만든다. 앵귤러 프레임워크 전체 구조부터 앵귤러 CLI를 활용한 애플리케이션 개발 방법, 앵귤러 생태계의 다양한 서드파티 라이브러리 활용과 파이어베이스를 사용한 앵귤러 웹 애플리케이션 배포까지 다루고 있다.\n\n앵귤러를 시작하는 데 가장 큰 걸림돌인 타입스크립트를 쉽게 설명하여 학습 부담을 줄여주며, 저자의 실무 경험을 적극 살려 실무에 꼭 필요한 개념과 실수하기 쉬운 부분을 자세히 설명한다.",
    "author": "조우진",
    "publisher": "한빛미디어",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3244280/32442801564.20250613072035.jpg"
  },
  {
    "id": "14",
    "title": "프레임워크 없는 프론트엔드 개발",
    "subTitle": "자바스크립트 프레임워크 뜯어보기",
    "description": "프레임워크 없이 효과적으로 작업하는 방법과 프로젝트에 적합한 프레임워크를 선택하는 방법의 두 가지 주제를 다룬다. 프레임워크나 서드파티 라이브러리를 사용하지 않고 프론트엔드 애플리케이션을 개발하는 방법을 알아보고 이에 따르는 자유도 알아본다. 또한 기술 부채 개념을 분석하고, 프레임워크가 프로젝트 수명에 어떤 영향을 주는지 분석한다. 이 책으로 프레임워크 없이 효과적으로 코딩하는 데 필요한 포괄적이고 명확한 가이드뿐만 아니라 기술적 의사 결정의 원칙도 배울 수 있다.",
    "author": "프란세스코 스트라츨로",
    "publisher": "한빛미디어",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3244151/32441517936.20240711093137.jpg"
  },
  {
    "id": "15",
    "title": "실전! RAG 기반 생성형 AI 개발",
    "subTitle": "라마인덱스, 딥 레이크, 파인콘으로 나만의 검색 증강 생성 파이프라인 만들기",
    "description": "RAG를 이용해 AI의 환각을 최소화하고, 임베딩 벡터 데이터베이스와 인간 피드백을 통합해서 정확하고 커스텀화된 생성형 AI 파이프라인을 구축한다!\n\n《실전! RAG 기반 생성형 AI 개발》은 성능과 비용의 균형을 맞추는 효과적인 LLM, 컴퓨터비전, 생성형 AI 시스템을 구축하기 위한 로드맵을 제시한다.\n\n이 책은 RAG와 다중 모달 AI 파이프라인을 설계, 관리, 제어하는 방법을 상세히 설명한다. RAG는 출력을 추적 가능한 원본 문서와 연결함으로써 출력의 정확성과 문맥 관련성을 향상시키며, 대량의 정보를 관리하는 동적 접근 방식을 가능하게 하는 기술이다. 이 책은 또한 벡터 저장소, 청킹, 색인화, 순위 지정에 대한 실용적 지식을 제공하며, RAG 프레임워크를 처음부터 끝까지 구축하는 방법을 보여준다. 적응형 RAG와 사람의 피드백을 활용한 검색 정확도 개선, RAG와 미세조정의 균형, 실시간 의사결정을 강화하는 동적 RAG 구현, 지식 그래프를 통한 복잡한 데이터 시각화 등 프로젝트 성능을 최적화하고 데이터를 더 잘 이해할 수 있는 기법들을 배우게 될 것이다.\n\n라마인덱스, 파인콘, 딥레이크 같은 프레임워크와 오픈AI, 허깅페이스 같은 생성형 AI 플랫폼을 이용한 풍부한 실습 예제를 담고 있다. 이 책을 통해 지능형 솔루션을 구현하는 기술을 습득한다면 프로덕션에서 고객 서비스까지 그 어떤 프로젝트에서도 경쟁력을 갖추게 될 것이다.\n\n★ 이 책에서 다루는 내용 ★\n\n◎ 대규모 데이터셋을 효율적으로 처리하도록 RAG \n파이프라인을 확장한다.◎ 환각 현상을 최소화하고 정확한 응답을 보장하는 기법을 적용한다.\n◎ 추적 가능하고 투명한 출력으로 AI 정확도를 높이는 색인화 기법을 구현한다.\n◎ RAG 주도 생성형 AI 시스템을 다양한 도메인에 걸쳐 커스텀화하고 확장한다.\n◎ 딥레이크와 파인콘을 활용해서 데이터를 더 빠르고 효율적으로 검색한다.\n◎ 실제 데이터에 기반해서 견고한 생성형 AI 시스템을 구축하고 제어한다.\n◎ 더 풍부하고 유익한 AI 응답을 위해 텍스트와 이미지 데이터를 결합한다.",
    "author": "데니스 로스먼",
    "publisher": "위키북스",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_5338659/53386597057.20250306094323.jpg"
  },
  {
    "id": "16",
    "title": "스위프트",
    "subTitle": "초보자를 위한 나만의 iOS 앱 만들기",
    "description": "스위프트가 처음이라면 바로 이 책입니다!\n\n아이폰으로 게임을 즐기거나 새로운 정보를 찾는 일은 늘 즐겁습니다. 하지만 직접 앱을 만든다면 얼마나 멋질까요? 조금만 연습하면 여러분도 앱을 개발할 수 있습니다! 애플의 스위프트 언어, 특별한 코딩 플레이그라운드, 편리한 프로그래밍 환경 덕분에 앱 개발이 한층 쉬워졌습니다. 다섯 살부터 프로그래밍을 시작한 탠메이 박시와 함께 앱 개발을 배워봅시다.\n\n이 책은 iOS 디바이스용 앱을 개발하는 방법을 단계별로 설명합니다. 수십 개의 앱을 구현하고, 연습 문제를 풀면서 게임을 개발하는 방법을 배우고, 수수께끼를 해결하며 아이폰이 할 수 있는 일을 배웁니다. 이 책과 함께 스위프트 여행을 시작하세요.",
    "author": "탠메이 박시",
    "publisher": "한빛미디어",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3248281/32482815017.20230110165142.jpg"
  },
  {
    "id": "17",
    "title": "돈 되는 안드로이드 앱 만들기",
    "subTitle": "안드로이드 앱 개발을 위한 기본적이고 필수적인 내용 수록",
    "description": "안드로이드 앱 개발에 필요한 자바 문법과 안드로이드 스튜디오 설치 과정을 설명하고, 안드로이드 앱을 직접 만들고 play스토어에 앱 등록하기까지 한 권으로 설명한다. Layout, View, Fragment 등 앱 만들기에 기본이 되는 기능을 설명하고, 그 기능을 토대로 간단한 랜덤 뽑기나 주사위 게임 앱 등을 만들어 본다.",
    "author": "조상철",
    "publisher": "영진.com(영진닷컴)",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3243623/32436237456.20250708072302.jpg"
  },
  {
    "id": "18",
    "title": "자바/스프링 개발자를 위한 실용주의 프로그래밍",
    "subTitle": "객체지향부터 스프링과 테스트까지, 다시 제대로 배우는 애플리케이션 개발",
    "description": "소프트웨어 개발을 잘하고 싶다면 ‘개발’ 공부를 해야 합니다!\n\n자바 개발자가 코틀린 같은 신생 언어를 다룰 수 있게 된다고 해서 개발을 더 잘하게 되는 것은 아닙니다. 소프트웨어 개발 능력을 키우고 싶다면 ‘개발’ 그 자체를 공부하고 기초적인 설계 원리를 이해할 수 있어야 합니다. 이 책은 객체지향, SOLID, 디자인 패턴, 테스트 같은 주요 개발 관련 이론이 실제 프로젝트에 어떻게 적용될 수 있는지 설명합니다.\n\n★ 이 책에서 다루는 내용 ★\n\n◎ 객체지향\n◎ SOLID\n◎ 스프링 안티 패턴\n◎ 스프링과 DDD\n◎ 레이어드 아키텍처\n◎ 헥사고날 아키텍처\n◎ 테스트가 필요한 이유\n◎ 테스트와 설계\n◎ 테스트 대역\n◎ TDD와 BDD",
    "author": "김우근",
    "publisher": "위키북스",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_4807682/48076823621.20240531103620.jpg"
  },
  {
    "id": "19",
    "title": "NestJS로 배우는 백엔드 프로그래밍",
    "subTitle": "타입스크립트 환경의 차세대 서버 프레임워크를 만나다",
    "description": "가장 진보한 프레임워크로 우아하게 백엔드 입문하기\n\nNestJS는 Express를 기반으로 DB, ORM, 유효성 검사 등의 라이브러리를 내장한 차세대 백엔드 프레임워크다. 제어 반전, 의존성 주입, AOP 등 객체 지향 개념을 도입했고 타입스크립트로 모듈/컴포넌트 기반의 프로그래밍을 할 수 있다. 이 책은 저자가 모두싸인에 몸담으며 익힌 노하우와 인사이트를 바탕으로 NestJS를 활용해 회원 가입, 이메일 인증, 로그인, 회원 정보 조회 기능을 갖춘 REST API 유저 서비스를 만들어본다. 프로젝트에 점차 살을 붙여나가며 백엔드 개발에 필요한 환경 변수 설정, 요청 유효성 검사, 인증(JWT), 로깅, 헬스 체크, CQRS, 클린 아키텍처, 단위 테스트 등 지식과 기술을 제대로 익힐 수 있게 집필했다.",
    "author": "한용재",
    "publisher": "제이펍",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3625009/36250090622.20230928092017.jpg"
  },
  {
    "id": "20",
    "title": "개발자의 글쓰기",
    "subTitle": "변수 네이밍부터 릴리스 노트, 장애 보고서, 기술 블로그까지!",
    "description": "오직 개발자를 위한 글쓰기의 모든 것을 담았습니다!\n\n이 책은 개발자의 글쓰기 능력을 종합적으로 향상하기 위한 책이다. 코드 안에서는 함수와 변수 이름을 짓는 것부터 주석 쓰는 법, 에러 메시지 쓰는 법까지 알려준다. 코드 밖에서는 릴리스 노트, 장애 보고서, 개발 가이드를 어떻게 하면 잘 쓸 수 있는지를 알려준다. 외주 개발을 하는 개발자를 위해 SI 제안서의 기술 부문을 설득력 있게 쓰는 법도 놓치지 않았다. 블로그를 운영하려는 개발자나 IT기업을 위해 기술 블로그를 쓰는 법과 운영하는 팁도 담았다.",
    "author": "김철수",
    "publisher": "위키북스",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3244520/32445200562.20230919122809.jpg"
  },
  {
    "id": "21",
    "title": "AI와 개발자",
    "subTitle": "개발자가 시대를 만든다",
    "description": "AI 활용을 통해 개발자가 어떻게 효율성을 높이고, 창의성을 발휘할 수 있을지 살핀다. 생성형 AI는 코드 작성, 디버깅 등에서 개발자들의 업무를 효율화하며, 기업의 비용 절감과 매출 증대에 기여하고 있다. AI의 발전은 개발자에게 기회와 도전 모두를 제공한다.",
    "author": "조정호",
    "publisher": "커뮤니케이션북스",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_5109340/51093401618.20241031071725.jpg"
  },
  {
    "id": "22",
    "title": "개발자 상식",
    "subTitle": "개발자가 되기 전에 알았어야 할 것들",
    "description": "이 책을 한 줄로 정의하면 ‘개발자가 되기 위해 기본적으로 알아야 할 I T 기술, 환경에 관한 넓고 얕은 지식’이다. 어렵게 머리를 싸매고 읽어야 하는 부담스러운 IT 책이 아닌, 개발자가 알아야 하는 꼭 필요한 개념과 용어를 인문 도서처럼 술술 읽을 수 있게 설명하였다. 개발자가 되기 위해 알아야 할 것은 두꺼운 책에나 쓰여 있는 딱딱한 지식이 아니다. 문제를 찾아 해결하기 위한 일련의 과정과 그 속에서 필요한 ‘키워드’와 ‘개념’이다. 이 책은 언어, 프레임워크, 디자인 패턴, 개발도구, 클라우드 등등 넓고 얕은 지식을 통해 검색하는 능력을 키우고 해결하고자 하는 문제를 스스로 찾아갈 수 있도록 도움을 줄 것이다.\n\n_대상 독자\n개발자가 되기 위해 공부하고 있는 취준생이 주독자층이지만,\n주니어 개발자도 이 책을 보고 자신의 상식 수준을 확인할 수 있습니다.\n개발자뿐만 아니라 기획자를 포함한 개발 문외한도 읽을 수 있게 쉽게 썼습니다.\n개발자가 되기 위해 면접을 보기 전에 부족한 점이 무엇인지 체크할 수 있습니다.",
    "author": "박민경",
    "publisher": "로드북",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_3351835/33518358684.20250314074412.jpg"
  },
  {
    "id": "23",
    "title": "AWS 교과서",
    "subTitle": "개념 설명과 실습 예제로 실속 있게 구성한 AWS 입문서!",
    "description": "이론과 실습으로 배우는 AWS!\n입문자에게 딱 맞는 구성으로 시작해보자!\n\nAWS는 다양한 퍼블릭 클라우드 서비스를 제공하고 있고, 현재 클라우드 플랫폼 중에서 점유율 1위를 차지하고 있다. 이미 많은 기업이 AWS를 도입했거나 도입을 고려하고 있는 만큼, AWS의 구조와 기능을 잘 알고 있어야 한다. 『AWS 교과서』는 컴퓨팅, 네트워킹, 부하분산, 스토리지, 데이터베이스, IAM, 오토 스케일링 등 주요 서비스를 중심으로 개념을 설명한다. 이론이 끝나면 실습으로 직접 서비스를 다뤄보기 때문에 어떻게 동작하는지 제대로 익힐 수 있다. 마지막 장에서는 AWS 서비스를 활용해 프로젝트 실습까지 해본다. AWS를 어디서부터 어떻게 공부해야 할지 모르겠다면 이 책으로 쉽게 입문해보자!",
    "author": "김원일,서종호,김석필",
    "publisher": "길벗",
    "coverImgUrl": "https://shopping-phinf.pstatic.net/main_4331382/43313827619.20231019092114.jpg"
  }
]
